{"intents":
  [
    {
      "tag":"menyapa",
      "patterns":["halo","hei", "hai", "hai, apakah ini layanan informasi tugas akhir","hei, apakah ini layanan informasi tugas akhir","halo, apakah ini layanan informasi tugas akhir"],
      "responses":[
          "Hai. Selamat datang di layanan informasi tugas akhir teknik informatika UNISSULA",
          "Hei, apakah kamu butuh bantuan?",
          "Selamat datang, ada yang bisa saya bantu?",
          "Hai, apa yang kamu inginkan?",
          "Halo teman, ada yang bisa saya bantu?",
          "Hai, senang kamu ada disini. apa yang ingin kamu tanyakan?"
        ]
    },
    {
      "tag":"berakhir",
      "patterns":["Terima kasih", "Terima kasih infonya", "bye", "bye bro", "oke bye", "selamat tinggal", "sampai jumpa lagi", "oke aku akan menemuimu nanti", "aku akan berbicara denganmu nanti", "akan mengirimimu pesan nanti", "bye bro, aku akan berbicara denganmu nanti"],
      "responses":[
          "Oke, semoga harimu menyenangkan",
          "Selamat tinggal",
          "sampai jumpa lagi"
        ]
    },
    {
      "tag":"definisi",
      "patterns":["Deskripsi dari Tugas Akhir?","Definisi dari TA?","Maksud dari Tugas Akhir","Apa yang dimaksud dengan Tugas Akhir?","Jelaskan Apa itu Tgas Akhir?","Apa arti yang terkandung dalam Tugas Akhir?","Apa yang sebenarnya dimaksudkan dengan istilah Tugas Akhir?","Apa itu TA atau Tugas Akhir?","Tolong jelaskan pengertian dari istilah TA atau Tugas Akhir","Tugas Akhir itu apa?","Mohon berikan penjelasan mengenai Tugas Akhir.","Saya ingin memahami definisi yang tepat untuk TA atau Tugas Akhir.","Apakah Anda bisa merinci konsep dari Tugas Akhir?","Saya bingung, bisakah Anda menjelaskan apa sebenarnya yang dimaksud dengan istilah Tugas Akhir?","Terminologi Tugas Akhir sering membingungkan, mohon beri pencerahan.","Apakah bisa dijelaskan arti istilah Tugas Akhir secara lebih terperinci?","Saya mendengar tentang Tugas Akhir, tetapi belum paham betul. Tolong jelaskan dengan lebih mudah dipahami.","Definisi dari istilah Tugas Akhir kurang jelas bagi saya. Apa Anda bisa membantu?","Saya perlu pemahaman yang lebih baik mengenai Tugas Akhir. Apa yang sebenarnya dimaksud dengan istilah tersebut?","Tugas Akhir sepertinya kompleks. Bisa dijelaskan dengan bahasa sederhana?","Sudah mendekati akhir perjalanan kuliah, tapi konsep Tugas Akhir masih kabur. Bisakah dijelaskan secara lebih gamblang?","Tugas Akhir: bisa berikan definisi yang lebih terangkai?","Apa sebenarnya yang ingin dikatakan orang saat menyebutkan Tugas Akhir? Saya belum paham.","Konsep Tugas Akhir kadang seperti teka-teki. Tolong dipecahkan dengan penjelasan yang lebih terperinci.","Saat mencari informasi tentang Tugas Akhir, yang muncul hanya kompleksitas. Mohon penjelasan yang lebih simpel.","Tugas Akhir atau TA: Mohon pencerahan agar tidak lagi bingung.","Pentingnya Tugas Akhir sebanding dengan kebingungannya. Apa yang sebenarnya dimaksud?","Tugas Akhir: informasi selengkap-lengkapnya, tolong!","Banyak istilah teknis dalam Tugas Akhir membuat saya penasaran. Bantu saya memahami.","Saat menjelang akhir masa kuliah, Tugas Akhir muncul sebagai hantu. Bisa dijelaskan apa itu sebenarnya?","Tugas Akhir dan kompleksitasnya butuh disederhanakan. Bisa disampaikan dengan cara yang lebih mudah?","Bagaimana Anda menjelaskan konsep dari Tugas Akhir?","Dapatkah Anda merinci apa yang dimaksud dengan Tugas Akhir?","Mohon dipaparkan pengertian yang lebih jelas mengenai Tugas Akhir.","Terminologi Tugas Akhir sulit dipahami, bisa dijelaskan lebih sederhana?","Saya butuh gambaran yang lebih lengkap mengenai Tugas Akhir. Bisa diuraikan?","Tugas Akhir atau TA: bisakah Anda menguraikan secara lebih rinci?","Apa yang sebenarnya diinginkan saat orang menyebut Tugas Akhir? Tolong jelaskan.","Saya merasa bingung dengan istilah Tugas Akhir. Bisakah dijelaskan dengan cara yang lebih mudah dimengerti?","Tugas Akhir terkadang membingungkan. Bisa dijelaskan dengan bahasa yang lebih sederhana?","Tolong ceritakan tentang Tugas Akhir dengan informasi yang lebih lengkap."],
      "responses":[
          "Tugas Akhir (TA) adalah hasil dari karya ilmiah yang diperoleh melalui penelitian atau pemecahan masalah yang dilakukan secara sistematis melalui analisis (usulan solusi dan hasilnya). Tugas Akhir merupakan mata kuliah wajib bagi semua mahasiswa Fakultas Teknologi Industri sebagai salah satu persyaratan untuk mendapatkan gelar Sarjana."
      ]
    },
    {
      "tag":"tujuan",
      "patterns":["Apakah tujuan dari Tugas Akhir?","Apa tujuan utama dari Tugas Akhir?","Apa yang ingin dicapai dari pengerjaan Tugas Akhir?","Apa target dari pengerjaan Akhir?","Apa alasan di balik pelaksanaan Tugas Akhir?","Apa manfaat dari Tugas Akhir?","Tujuan dari pengerjaan Tugas Akhir adalah apa?","Mengapa mahasiswa harus mengerjakan Tugas Akhir?","Mengapa mahasiswa harus mengerjakan TA?","Apakah tujuan dari TA?","Apa tujuan utama TA?","Apa alasan di balik pelaksanaan TA?","Apa manfaat dari TA?","Kenapa mahasiswa harus mengerjakan Tugas Akhir?","Mengapa penting bagi mahasiswa untuk menyelesaikan Tugas Akhir dan apa yang ingin dicapai melalui proses tersebut?","Apa latar belakang dari pelaksanaan Tugas Akhir dan apa yang diharapkan dapat tercapai?","Tugas Akhir memiliki tujuan apa dan mengapa mahasiswa perlu menjalaninya?","Apa landasan utama yang mendasari pengisian waktu dan usaha pada pelaksanaan Tugas Akhir?","Bagaimana relevansi Tugas Akhir dengan tujuan akhir pendidikan, dan mengapa mahasiswa diarahkan untuk melakukannya?","Apa yang ingin didemonstrasikan oleh mahasiswa melalui Tugas Akhir, dan mengapa hal itu menjadi aspek penting dalam perkuliahan?","Mengapa mahasiswa perlu mengejar penyelesaian Tugas Akhir dan apa yang dapat diperoleh darinya?","Tugas Akhir sebagai bagian integral dari kurikulum: Mengapa demikian dan apa manfaatnya?","Apa alasan kuat di balik keberadaan Tugas Akhir dalam setiap program studi?","Mengapa mahasiswa harus menjalani proses melelahkan untuk Tugas Akhir, dan apa yang diharapkan sebagai hasil akhirnya?","Apakah ada manfaat konkret dari pengerjaan Tugas Akhir bagi mahasiswa, dan mengapa hal itu menjadi prioritas?","Apakah landasan pelaksanaan Tugas Akhir dan apa motivasi dalam menyelesaikannya?","Apa inti dari pengerjaan Tugas Akhir dan mengapa mahasiswa perlu menyelesaikannya untuk mencapai hal tersebut?","Mengapa Tugas Akhir menjadi bagian penting dari perjalanan akademik dan apa yang ingin dihasilkan darinya?","Apa yang ingin dicapai mahasiswa melalui Tugas Akhir?","Tugas Akhir sebagai refleksi atas apa yang telah dipelajari: Mengapa demikian?","Apa alasan kuat mahasiswa harus menyelesaikan Tugas Akhir sebagai syarat kelulusan?","Mengapa mahasiswa diarahkan untuk fokus pada Tugas Akhir dan apa dampak positif yang diharapkan?","Apa yang ingin mahasiswa tunjukkan ketika mereka melaksanakan Tugas Akhir?","Mengapa Tugas Akhir menjadi tonggak penting dalam perjalanan pendidikan tinggi?","Apa manfaat utama yang bisa diperoleh mahasiswa melalui kelengkapan Tugas Akhir?"],
      "responses":[
          "Mata kuliah (MK) Tugas Akhir diselenggarakan untuk mencapai tiga kompetensi lulusan atau Course Learning Outcome (CLO), yaitu: 1. Mampu membuat karya tulis ilmiah yang mengkaji atau menerapkan konsep ilmu pengetahuan/teknologi bidang computing berdasarkan kaidah, tata cara dan etika ilmiah, 2. Mampu mengkomunikasikan dan berargumen secara lisan atau tulisan terkait solusi/gagasan/desain hasil kajian ilmu pengetahuan/teknologi bidang computing dan 3. Mampu membuat produk/prototype/model yang mengkaji atau menerapkan ilmu pengetahuan/teknologi bidang computing untuk menghasilkan solusi dari suatu permasalahan."
      ]
    },
    {
      "tag":"mengambil_matkul_TA",
      "patterns":["Apa saja persyaratan mengambil matakuliah tugas akhir?","Apa persyaratan bagi mahasiswa yang ingin mengambil matakuliah tugas akhir?","Apa ketentuan bagi mahasiswa yang ingin mengikuti matakuliah tugas akhir?","Apa prasyarat untuk mendaftar matakuliah tugas akhir?","Bagaimana cara mengambil matakuliah Tugas Akhir?","Bagaimana caranya agar bisa mengambil matakuliah Tugas Akhir?","Bagaimana cara mengambil matakuliah TA?","Bagaimana caranya untuk mengikuti matakuliah Tugas Akhir?","Apa yang perlu dilakukan agar bisa mengambil matakuliah TA?","Cara mengambil matakuliah TA?","Persyaratan mengambil matakuliah TA","Apa syarat-syarat yang harus dipenuhi mahasiswa sebelum mengambil matakuliah Tugas Akhir?","Bagaimana langkah-langkah untuk mendaftar dan mengambil matakuliah Tugas Akhir?","Apa yang diperlukan mahasiswa agar memenuhi ketentuan mengikuti matakuliah Tugas Akhir?","Bagaimana prosedur pendaftaran matakuliah Tugas Akhir?","Apa langah-langkah yang harus diikuti mahasiswa untuk mengambil matakuliah Tugas Akhir?","Bagaimana caranya mahasiswa dapat mengikuti matakuliah Tugas Akhir?","Apa yang harus dilakukan agar memenuhi persyaratan mengambil matakuliah Tugas Akhir?","Cara mendaftar dan mengakses matakuliah Tugas Akhir?","Apa persyaratan utama yang harus dipatuhi mahasiswa sebelum mengambil matakuliah Tugas Akhir?","Langkah-langkah praktis untuk mendaftar dan berhasil mengambil matakuliah Tugas Akhir.","Apa kriteria yang harus dipenuhi oleh mahasiswa sebelum mendaftar matakuliah Tugas Akhir?","Langkah-langkah apa yang perlu diikuti mahasiswa agar bisa mengambil matakuliah Tugas Akhir?","Apa saja syarat yang harus dipatuhi mahasiswa sebelum mengambil matakuliah Tugas Akhir?","Bagaimana caranya mahasiswa memenuhi persyaratan untuk mengambil matakuliah Tugas Akhir?","Apa panduan pendaftaran untuk matakuliah Tugas Akhir?","Bagaimana mahasiswa dapat mendaftar dan mengikuti matakuliah Tugas Akhir?","Apa langkah konkret yang perlu diambil mahasiswa agar bisa mengerjakan matakuliah Tugas Akhir?","Apa saja kebutuhan yang harus dipenuhi sebelum matakuliah Tugas Akhir dapat diambil?","Bagaimana mengakses matakuliah Tugas Akhir setelah memenuhi persyaratan?","Apa saja informasi penting mengenai mendaftar dan mengambil matakuliah Tugas Akhir?","Apa panduan pendaftaran yang harus diikuti untuk matakuliah Tugas Akhir?","Bagaimana mahasiswa bisa mendaftar dan mengikuti matakuliah Tugas Akhir?","Apa langkah konkret yang perlu diambil oleh mahasiswa untuk dapat mengerjakan matakuliah Tugas Akhir?","Apa saja kebutuhan yang harus dipenuhi sebelum dapat mengambil matakuliah Tugas Akhir?","Bagaimana cara mengakses matakuliah Tugas Akhir setelah memenuhi persyaratan?","Apa informasi penting yang perlu diketahui mengenai proses pendaftaran dan pengambilan matakuliah Tugas Akhir?","Apa tahapan yang harus dilalui oleh mahasiswa sebelum dapat mengambil matakuliah Tugas Akhir?","Bagaimana cara mendaftar dan mendapatkan akses ke matakuliah Tugas Akhir?","Apa yang harus dipersiapkan oleh mahasiswa sebelum mengambil matakuliah Tugas Akhir?","Bagaimana langkah-langkah praktis untuk berhasil mendaftar dan mengikuti matakuliah Tugas Akhir?","Apa persyaratannya bagi mahasiswa sebelum mengambil matakuliah Tugas Akhir?","Bagaimana langkah-langkah pendaftaran dan akses matakuliah Tugas Akhir?","Apa yang perlu dipersiapkan oleh mahasiswa sebelum mengikuti matakuliah Tugas Akhir?","Bagaimana cara mendaftar dan mengakses konten matakuliah Tugas Akhir?","Apa informasi penting yang harus diketahui mengenai proses pendaftaran dan pengambilan matakuliah Tugas Akhir?","Apa tahapan yang harus dilalui oleh mahasiswa sebelum dapat memulai matakuliah Tugas Akhir?"],
      "responses":[
          "mahasiswa yang ingin mengajukan atau mendaftar tugas akhir harus melengkapai dua persyaratan administrasi dan akademik"
      ]
    },
    {
      "tag":"administrasi",
      "patterns":["Apa saja persyaratan administrasi yang diperlukan?", "Apa kelengkapan administrasi yang harus dipenuhi untuk mengambil matakuliah Tugas Akhir?", "Apa yang perlu dipersiapkan secara administratif untuk mendaftar matakuliah Tugas Akhir?", "Apa persyaratan administratif yang harus terpenuhi untuk mengikuti tugas akhir?", "Persyaratan administrasi seperti apa yang dibutuhkan dalam pendaftaran matakuliah Tugas Akhir?", "Apa persyaratan administratif yang harus dipenuhi?", "Apa saja persyaratan administrasi untuk mendaftar TA?", "Apa yang harus disiapkan secara administratif saat mendaftar TA?", "Apa yang perlu dipenuhi secara administratif untuk mendaftar TA?", "Apa persyaratan berkas administratif yang harus dipersiapkan saat mendaftar TA?", "Apa elemen administrasi yang diperlukan sebagai syarat mengambil matakuliah Tugas Akhir?", "Apa komponen persyaratan administrasi yang harus terpenuhi oleh mahasiswa sebelum mendaftar matakuliah Tugas Akhir?", "Bagaimana cara melengkapi persyaratan administrasi untuk mengambil matakuliah Tugas Akhir?", "Apa informasi administratif yang harus dipersiapkan sebelum mengambil matakuliah Tugas Akhir?", "Persyaratan administratif seperti apa yang harus dicukupi sebelum mengikuti tugas akhir?", "Apa yang harus dipenuhi secara administratif untuk mendaftar dan mengambil matakuliah Tugas Akhir?", "Apa yang termasuk dalam persyaratan administrasi yang diperlukan untuk mengambil matakuliah TA?", "Apa saja komponen persyaratan administrasi yang harus terpenuhi oleh mahasiswa?", "Apa persyaratan administrasi yang wajib dipenuhi untuk mendaftar matakuliah Tugas Akhir?", "Bagaimana cara menyiapkan dokumen administratif untuk pendaftaran matakuliah TA?", "Apa saja syarat administratif yang harus terpenuhi sebelum mendaftar matakuliah TA?", "Bagaimana cara memenuhi persyaratan administrasi untuk mengambil Tugas Akhir?", "Apa peraturan administratif yang harus diikuti oleh mahasiswa dalam mengambil matakuliah TA?", "Apa saja komponen persyaratan administrasi yang harus dikumpulkan saat mendaftar matakuliah Tugas Akhir?", "Bagaimana langkah-langkah administratif untuk memenuhi persyaratan mengambil matakuliah Tugas Akhir?", "Apa informasi penting yang harus disiapkan oleh mahasiswa sebagai persyaratan administrasi dalam mengambil matakuliah Tugas Akhir?", "Apa dokumen administratif yang harus dipersiapkan sebelum mendaftar matakuliah TA?", "Bagaimana cara menyelesaikan persyaratan administrasi untuk mengikuti Tugas Akhir?", "Apa yang dibutuhkan oleh mahasiswa untuk melengkapi persyaratan administrasi dalam mengambil matakuliah TA?", "Bagaimana cara mengurus persyaratan administrasi saat ingin mengambil matakuliah Tugas Akhir?"],
      "responses":[
          "Secara administrasi mahasiswa dapat mengambil mata kuliah TA jika terdaftar sebagai mahasiswa aktif Fakultas Teknologi Industri"
      ]
    },
    {
      "tag":"akademik",
      "patterns":["Apa saja persyaratan akademik?","Apa saja persyaratan akademik untuk mengambil matakuliah TA atau tugas akhir?","Apa kriteria akademik yang harus dipenuhi untuk mengajukan tugas akhir?","Apa saja syarat akademik yang harus terpenuhi untuk mengambil matakuliah tugas akhir?","Apa yang harus dicapai dari segi akademik sebelum mengambil matakuliah tugas akhir?","Apa prasyarat akademik yang harus dipenuhi untuk mengambil tugas akhir?","Apa persyaratan akademik yang harus dipenuhi sebelum mengikuti tugas akhir?","Apa kualifikasi akademik yang diperlukan untuk mengambil tugas akhir?","Apa yang harus dipersiapkan dalam hal akademik sebelum mengambil TA?","Apa standar akademik yang harus dicapai untuk mengambil matakuliah TA?","Apa persyaratan bidang akademik yang perlu dipenuhi sebelum mendaftar matakuliah TA?","Apa komponen persyaratan akademik yang harus terpenuhi untuk mengambil matakuliah tugas akhir?","Apa saja kriteria akademik yang harus dicapai sebelum mempertimbangkan pengambilan matakuliah TA?","Apa yang harus dicapai dari segi akademik sebelum memenuhi syarat mengambil matakuliah tugas akhir?","Apa prasyarat di segi akademik yang harus dipenuhi sebelum mahasiswa dapat mengikuti matakuliah TA?","Apa standar akademik yang perlu dipenuhi sebelum mendaftar dan mengambil tugas akhir?","Apa persyaratan akademik yang harus dipenuhi sebelum memasuki tahap pengambilan matakuliah tugas akhir?","Apa yang harus dipersiapkan dalam aspek akademik sebelum mahasiswa bisa mengambil TA?","Apa persyaratan pencapaian akademik yang harus terpenuhi untuk memenuhi syarat pengambilan matakuliah TA?","Apa persyaratan prestasi akademik yang harus dicapai sebelum mahasiswa bisa mengikuti matakuliah tugas akhir?","Apa persyaratan akademik yang diperlukan sebelum memasuki tahap pengambilan matakuliah TA?","Apa kriteria akademik yang harus dipenuhi mahasiswa sebelum dapat mendaftar matakuliah Tugas Akhir?","Apa saja persyaratan pendidikan yang harus terpenuhi sebelum mengambil matakuliah TA?","Apa syarat akademik yang harus dipenuhi agar bisa mengikuti matakuliah Tugas Akhir?","Apa saja persyaratan akademik yang harus dipatuhi sebelum memulai matakuliah TA?","Apa prasyarat akademik yang harus dipenuhi sebelum mahasiswa diizinkan mengambil matakuliah Tugas Akhir?","Apa komponen persyaratan akademik yang harus dipenuhi sebelum mendaftar matakuliah TA?","Apa yang perlu dicapai mahasiswa dalam aspek akademik sebelum diperbolehkan mengambil matakuliah Tugas Akhir?","Apa saja yang harus disiapkan mahasiswa dalam hal pencapaian akademik sebelum mengambil matakuliah TA?","Apa persyaratan akademik secara spesifik yang harus dipenuhi untuk mendaftar dan mengambil matakuliah Tugas Akhir?","Apa saja persyaratan akademik yang perlu terpenuhi sebelum mendaftar matakuliah Tugas Akhir?","Apa kriteria akademik yang harus dipenuhi untuk mengikuti matakuliah Tugas Akhir?","Apa persyaratan pendidikan yang harus dipenuhi sebelum memasuki tahap pengambilan matakuliah Tugas Akhir?","Apa standar akademik yang harus dicapai sebelum diperbolehkan mengambil matakuliah Tugas Akhir?","Apa yang perlu dicapai dari segi akademik sebelum diizinkan mengambil matakuliah Tugas Akhir?","Apa persyaratan prestasi akademik yang harus dipenuhi sebelum mahasiswa bisa mengambil matakuliah Tugas Akhir?","Apa syarat akademik yang harus terpenuhi agar bisa mengikuti matakuliah Tugas Akhir?","Apa saja kualifikasi akademik yang diperlukan sebelum mengambil matakuliah Tugas Akhir?","Bagaimana persyaratan akademik yang harus terpenuhi sebelum mahasiswa dapat mengikuti matakuliah Tugas Akhir?","Apa komponen persyaratan pendidikan yang harus dipenuhi sebelum memulai matakuliah TA?","Apa yang harus dicapai dalam aspek akademik sebelum diperbolehkan mengambil matakuliah Tugas Akhir?","Apa persyaratan prestasi akademik yang harus dicapai sebelum mahasiswa bisa mengambil matakuliah Tugas Akhir?","Apa kriteria akademik yang perlu dipatuhi sebelum memasuki tahap pengambilan matakuliah TA?","Apa standar akademik yang harus dipenuhi sebelum mendaftar matakuliah Tugas Akhir?","Apa yang perlu disiapkan mahasiswa dalam hal pencapaian akademik sebelum mengambil matakuliah TA?","Apa persyaratan akademik secara spesifik yang harus terpenuhi untuk mendaftar dan mengambil matakuliah Tugas Akhir?","Apa saja syarat akademik yang perlu diperhatikan agar bisa mengikuti matakuliah Tugas Akhir?"],
      "responses":[
          "Secara akademik mahasiswa dapat mengikuti mata kuliah TA jika memenuhi persyaratan sebagai berikut:1. Lulus MK Metodologi Penelitian, 2. Mengambil KRS TA pada semester yang sedang berjalan, 3. Sekurang-kurangnya sudah lulus 130 SKS (Tanpa Nilai E) pada semester tersebut, dengan IPK ≥ 2,50"
      ]
    },
    {
      "tag":"pelaksanaan",
      "patterns":["Kapan waktu pelaksanaan tugas akhir?","Kapan rencana pelaksanaan tugas akhir?","Kapan jadwal pelaksanaan tugas akhir dijadwalkan?","Kapan periode pelaksanaan tugas akhir?","Kapan tugas akhir diselengkarakan?","Kapan proses pelaksanaan TA?","Tugas Akhir atau TA dilaksanaan pada saat apa?","Kapan waktu yang ditentukan untuk menjalankan Tugas Akhir?","Kapan TA direncanakan akan dilaksanakan?","Kapan jadwal pelaksanaan Tugas Akhir dijadwalkan berlangsung?","Kapan masa pelaksanaan Tugas Akhir biasanya berlangsung?","Kapan Tugas Akhir umumnya diselenggarakan?","Kapan proses pelaksanaan Tugas Akhir berlangsung?","Pada waktu apa Tugas Akhir atau TA dijalankan?","Kapan periode pelaksanaan Tugas Akhir biasanya dimulai?","Kapan rencana pelaksanaan Tugas Akhir biasanya dibuat?","Pada saat apa Tugas Akhir atau TA biasanya dilakukan?","Kapan waktu pengerjaan Tugas Akhir dimulai?","Kapan Tugas Akhir biasanya dikerjakan?","Kapan mahasiswa mulai melaksanakan Tugas Akhir?","Kapan Tugas Akhir umumnya dijalankan?","Kapan tahap akhir studi dilaksanakan?","Kapan periode penyelesaian Tugas Akhir berlangsung?","Kapan jadwal pelaksanaan Tugas Akhir ditentukan?","Kapan mahasiswa biasanya fokus pada Tugas Akhir?","Kapan persiapan untuk Tugas Akhir dimulai?","Kapan Tugas Akhir selesai dan dipresentasikan?","Kapan waktu pelaksanaan Tugas Akhir biasanya terjadi?","Kapan rencana pelaksanaan Tugas Akhir umumnya dibuat?","Kapan jadwal pelaksanaan Tugas Akhir biasanya dijadwalkan?","Kapan periode pelaksanaan Tugas Akhir umumnya dimulai dan berakhir?","Kapan Tugas Akhir atau TA biasanya diselenggarakan?","Kapan proses pelaksanaan Tugas Akhir umumnya berlangsung?","Pada saat apa Tugas Akhir atau TA biasanya dijalankan?","Kapan waktu pengerjaan Tugas Akhir umumnya dimulai?","Kapan mahasiswa biasanya mulai melaksanakan Tugas Akhir?","Kapan tahap akhir studi atau penyelesaian Tugas Akhir biasanya berlangsung?","Kapan periode penyelesaian Tugas Akhir umumnya berlangsung?","Kapan jadwal pelaksanaan Tugas Akhir biasanya ditentukan?","Kapan mahasiswa umumnya fokus pada persiapan Tugas Akhir?","Kapan persiapan untuk Tugas Akhir biasanya dimulai?","Kapan Tugas Akhir biasanya selesai dan dipresentasikan?","Pada saat apa Tugas Akhir atau TA biasanya dilaksanakan?","Kapan masa pelaksanaan Tugas Akhir umumnya berlangsung?","Kapan tahap akhir studi atau penyelesaian Tugas Akhir biasanya terjadi?","Kapan periode penyelesaian Tugas Akhir umumnya dimulai dan berakhir?","Kapan rencana pelaksanaan Tugas Akhir umumnya dibuat?","Kapan jadwal pelaksanaan Tugas Akhir biasanya dijadwalkan?","Kapan proses pelaksanaan Tugas Akhir umumnya berlangsung?","Kapan mahasiswa umumnya fokus pada persiapan Tugas Akhir?","Kapan persiapan untuk Tugas Akhir biasanya dimulai?","Kapan Tugas Akhir umumnya selesai dan dipresentasikan?"],
      "responses":[
          "Proses pelaksanaan TA dilaksanakan dalam masa satu semester dimulai dari tahap Seminar Proposal TA dan diakhiri dengan tahap Sidang TA / Ujian Sarjana"
      ]
    },
    {
      "tag":"tahapan",
      "patterns":["Apa saja langkah-langkah dalam penyusunan tugas akhir?","Bagaimana proses yang harus dijalani dalam menyiapkan tugas akhir?","Bagaimana urutan pengerjaan dalam menyusun TA atau Tugas Akhir?","Tahapan apa yang perlu dilewati dalam menyusun tugas akhir?","Apa langkah-langkah yang harus dipatuhi dalam proses penyusunan tugas akhir?","Bagaimana cara menyusun tugas akhir dengan benar?","Tahapan dalam penyusunan Tugas Akhir","Apa yang diperlukan untuk menyelesaikan Tugas Akhir?","Apa saja tahapan dalam penyususnan TA?","Bagaimana langkah awal dalam menyiapkan Tugas Akhir?","Apa urutan yang harus diikuti dalam menyusun TA atau Tugas Akhir?","Tahapan apa saja yang harus dilewati dalam proses penyusunan tugas akhir?","Bagaimana cara efektif untuk menyusun tugas akhir?","Apa langkah pertama yang perlu diambil dalam penyusunan Tugas Akhir?","Proses seperti apa yang harus dilalui untuk menyelesaikan Tugas Akhir?","Apa langkah-langkah kunci dalam menyusun tugas akhir dengan baik?","Tahapan apa yang biasanya dilalui dalam penyusunan TA?","Bagaimana cara terbaik untuk menavigasi penyusunan tugas akhir?","Apa yang diperlukan agar berhasil menyelesaikan Tugas Akhir?","Apa langkah selanjutnya setelah merumuskan judul Tugas Akhir?","Bagaimana cara merencanakan urutan langkah dalam menyelesaikan Tugas Akhir?","Apa yang perlu dilakukan setelah tahap pemilihan tema Tugas Akhir?","Bagaimana langkah mengumpulkan bahan referensi untuk Tugas Akhir?","Apa yang harus diperhatikan dalam proses perumusan masalah Tugas Akhir?","Bagaimana cara terbaik untuk merancang kerangka Tugas Akhir?","Apa yang perlu dipersiapkan setelah memiliki rencana kerangka Tugas Akhir?","Bagaimana tahap analisis data dalam penyusunan Tugas Akhir?","Apa langkah konkret dalam menyusun bab akhir dan kesimpulan Tugas Akhir?","Bagaimana cara mengatur jadwal revisi dan penyempurnaan Tugas Akhir?","Bagaimana langkah-langkah yang harus diikuti dalam proses penyusunan Tugas Akhir?","Apa urutan pengerjaan yang sebaiknya diikuti dalam menyusun TA atau Tugas Akhir?","Tahapan apa yang perlu dilalui dalam proses menyusun Tugas Akhir?","Apa langkah-langkah kunci yang harus dipatuhi untuk berhasil menyusun Tugas Akhir?","Bagaimana cara efektif untuk merencanakan dan menyusun Tugas Akhir?","Tahapan dalam penyusunan Tugas Akhir: dari langkah awal hingga akhir.","Apa yang diperlukan dan bagaimana cara merencanakan langkah-langkah dalam menyelesaikan Tugas Akhir?","Bagaimana cara terbaik untuk mengatur urutan langkah dalam penyusunan Tugas Akhir?","Setelah merumuskan judul Tugas Akhir, apa langkah selanjutnya yang harus diambil?","Bagaimana langkah mengumpulkan bahan referensi dan data yang diperlukan untuk Tugas Akhir?","Apa yang perlu diperhatikan saat merumuskan masalah Tugas Akhir dan merancang kerangka?","Bagaimana tahap analisis data dalam konteks penyusunan Tugas Akhir?","Apa langkah konkret dalam menyusun bab akhir dan kesimpulan yang kuat untuk Tugas Akhir?","Bagaimana cara efektif mengatur jadwal revisi dan penyempurnaan dalam Tugas Akhir?","Bagaimana cara merancang kerangka Tugas Akhir dan menetapkan langkah-langkah selanjutnya?","Apa yang perlu dipersiapkan setelah tahap pemilihan tema dan perumusan masalah Tugas Akhir?","Bagaimana langkah-langkah mendetail dalam menyiapkan bab akhir dan kesimpulan yang memuaskan?","Apa langkah-langkah konkret untuk mengorganisir bahan referensi dalam Tugas Akhir?","Bagaimana proses merencanakan dan melaksanakan revisi serta penyempurnaan Tugas Akhir?","Tahapan lengkap dari awal hingga akhir dalam proses penyusunan Tugas Akhir."],
      "responses":[
          "agar mahasiswa dapat menyelesaikan Tugas Akhir, mahasiswa harus melewati Tahapan dalam penyusunan Tugas akhir, yakni: (1) Pengajuan Proposal Tugas akhir atau judul Tugas Akhir, (2) Seminar Proposal TA, (3) Seminar Hasil / Seminar Nasional, (4) Ujian Sarjana / Sidang TA"
      ]
    },
    {
      "tag":"cara_pengajuan",
      "patterns":["Bagaimana langkah-langkah pengajuan judul tugas akhir?","Bagaimana tata cara mengajukan judul tugas akhir?","Apa tahapan dalam pengajuan judul tugas akhir?","Apa yang perlu diikuti dalam prosedur pengajuan judul tugas akhir?","Apa saja petunjuk dalam pengajuan judul tugas akhir?","Apa yang harus diperhatikan saat ingin mengajukan judul tugas akhir?","Apa saja persyaratan yang dibutuhkan untuk mengajukan judul tugas akhir?","Bagaimana proses yang harus dilakukan ketika ingin mengajukan judul?","Bagaimana cara mengajukan judul Tugas Akhir?","Bagaimana langkah-langkah mengajukan judul TA?","Apa yang perlu dilakukan ketika ingin mengajukan judul?","Apa yang perlu diperhatikan ketika ingin mengajukan judul TA?","Bagaimana langkah-langkah formal dalam mengajukan judul tugas akhir?","Apa urutan yang harus diikuti dalam prosedur pengajuan judul tugas akhir?","Bagaimana proses administratif dalam pengajuan judul tugas akhir?","Apa saja tahapan yang harus dilalui untuk mengajukan judul tugas akhir?","Bagaimana cara mematuhi pedoman saat ingin mengajukan judul tugas akhir?","Apa langkah-langkah praktis untuk mengajukan judul tugas akhir?","Apa yang harus dipersiapkan sebelum mengajukan judul tugas akhir?","Bagaimana cara formal untuk memulai proses pengajuan judul?","Apa yang perlu dilakukan agar berhasil mengajukan judul Tugas Akhir?","Bagaimana tata cara mengikuti prosedur pengajuan judul TA?","Bagaimana langkah-langkah yang harus diikuti dalam proses mengajukan judul Tugas Akhir?","Apa tahapan formal dalam pengajuan judul tugas akhir?","Apa yang harus diperhatikan dan diikuti dalam prosedur formal pengajuan judul tugas akhir?","Bagaimana tata cara yang tepat dalam mengajukan judul tugas akhir?","Apa saja persyaratan administratif yang perlu dipenuhi untuk mengajukan judul tugas akhir?","Bagaimana langkah-langkah praktis dan urutan yang harus dijalani dalam mengajukan judul tugas akhir?","Apa yang perlu dipersiapkan sebelum memulai proses pengajuan judul Tugas Akhir?","Bagaimana cara mengikuti prosedur formal dan mematuhi pedoman dalam pengajuan judul tugas akhir?","Apa langkah-langkah esensial untuk berhasil mengajukan judul Tugas Akhir?","Bagaimana tata cara formal yang harus dijalani dalam mengikuti proses pengajuan judul Tugas Akhir?","Apa yang perlu dilakukan agar dapat sukses dalam mengajukan judul Tugas Akhir?","Bagaimana cara memahami dan mengikuti langkah-langkah administratif dalam mengajukan judul tugas akhir?","Apa urutan yang harus diikuti untuk menyelesaikan proses pengajuan judul tugas akhir?","Bagaimana proses formal dalam mengajukan judul Tugas Akhir dan bagaimana cara melakukannya?","Apa persiapan yang harus dilakukan sebelum mengajukan judul tugas akhir?","Bagaimana langkah-langkah praktis dan efisien dalam pengajuan judul tugas akhir?","Apa yang perlu diperhatikan dan dipelajari saat ingin mengajukan judul Tugas Akhir?","Bagaimana cara mengikuti tata tertib dan langkah-langkah formal dalam pengajuan judul tugas akhir?","Apa yang harus disiapkan dan diperhatikan dalam proses pengajuan judul Tugas Akhir?","Bagaimana langkah-langkah untuk memulai dan menyelesaikan proses pengajuan judul Tugas Akhir dengan benar?","Bagaimana langkah-langkah yang perlu diikuti dalam proses pengajuan judul tugas akhir?","Apa tata cara yang harus dijalani saat ingin mengajukan judul tugas akhir?","Apa tahapan formal yang harus dilalui dalam pengajuan judul tugas akhir?","Apa yang perlu diperhatikan dan diikuti dalam prosedur pengajuan judul tugas akhir?","Apa saja petunjuk penting yang perlu diikuti ketika ingin mengajukan judul tugas akhir?","Apa yang harus diperhatikan dan dipelajari sebelum memulai proses pengajuan judul tugas akhir?","Apa saja persyaratan administratif yang dibutuhkan untuk berhasil mengajukan judul tugas akhir?","Bagaimana cara memahami dan mengikuti langkah-langkah formal dalam pengajuan judul tugas akhir?","Apa yang perlu dipersiapkan dan dilakukan sebelum mengajukan judul Tugas Akhir?","Bagaimana langkah-langkah praktis dan efektif dalam mengajukan judul tugas akhir?"],
      "responses":[
          "a. Waktu pengajuan judul/draft proposal bisa kapan saja, b. Mata Kuliah Tugas Akhir sudah dimasukkan kedalam Kartu Rencana Studi(KRS), c.  Mendaftar ke Bag. Adm TA dengan melampirkan persyaratan, d. Blanko disertai Proposal diajukan ke koordinator Tugas Akhir, e. Calon pembimbing ditentukan oleh koordinator TA dan disesuaikan dengan bidang keilmuan masing-masing, f. Setelah penentuan pembimbing, mahasiswa melakukan proses bimbingan pra seminar proposal untuk persiapan seminar proposal"
      ]
    },
    {
      "tag":"dokumen_persyaratan",
      "patterns":["Apa persyaratan yang perlu disertakan ke admin tugas akhir?","Dokumen apa yang harus diserahkan kepada admin tugas akhir?","Berkas apa yang perlu dilampirkan saat mengajukan tugas akhir ke admin?","Apa saja kelengkapan yang harus dilampirkan ke admin tugas akhir?","Apa yang harus dimasukkan sebagai persyaratan saat mengajukan tugas akhir ke admin?","Dokumen apa yang perlu diunggah ke admin tugas akhir?","Apa persyaratan yang harus dilampirkan sebagai syarat mengajukan tugas akhir ke admin?","Dokumen apa yang harus diberikan ke admin untuk proses tugas akhir?","Kelengkapan administratif apa yang harus diajukan kepada admin tugas akhir?","Dokumen apa saja yang harus dikirim ke admin?","Apa saja dokumen yang harus dilampirkan ke admin tugas akhir?","Apa saja dokumen yang harus dijukan kepada petugas administrasi tugas akhir?","Dokumen-dokumen apa yang diperlukan untuk diajukan kepada admin tugas akhir?","Apa isian wajib yang harus ada dalam pengajuan dokumen ke admin tugas akhir?","Apa saja berkas yang harus dilampirkan saat menyampaikan persyaratan kepada admin tugas akhir?","Apa yang harus Anda kumpulkan sebagai syarat dalam mengajukan dokumen ke petugas administrasi tugas akhir?","Dokumen apa yang perlu dipersiapkan dan diberikan kepada admin sebagai kelengkapan tugas akhir?","Apa syarat utama yang harus dipenuhi dalam mengajukan dokumen ke petugas admin tugas akhir?","Apa saja dokumen yang harus Anda unggah saat melakukan proses administrasi tugas akhir?","Apa kelengkapan berkas yang diperlukan untuk diserahkan kepada admin dalam proses tugas akhir?","Apa informasi penting yang harus dilampirkan ke admin sebagai bagian dari persyaratan tugas akhir?","Apa saja persyaratan dokumen yang perlu diberikan kepada admin tugas akhir?","Dokumen apa yang diperlukan saat mengajukan tugas akhir kepada admin?","Apa kelengkapan yang harus disiapkan dalam pengajuan tugas akhir kepada admin?","Apa yang harus dimasukkan sebagai bagian dari dokumen pengajuan tugas akhir ke admin?","Apa dokumen yang harus diunggah atau disampaikan kepada petugas admin tugas akhir?"],
      "responses":[
          "(1) Fotocopy KRS yang mencantumkan Mata Kuliah Tugas Akhir, (2) Cetak Transkrip nilai dengan ketentuan telah lulus MK dengan SKS ≥130 dan IP kumulatif ≥ 2,50, (3) Proposal TA yang telah disahkan oleh koordinator Tugas Akhir, (4) mengisi blanko pengajuan judul/draft proposal dan pembimbing di Adm. TA"
      ]
    },
    {
      "tag":"tahapan seminar",
      "patterns":["Apa saja tahapan dalam melakukan seminar TA?","Apa prosedur yang harus diikuti dalam melakukan seminar TA?","Apa saja fase-fase yang terlibat dalam melakukan seminar TA?","Bagaimana urutan langkah dalam menyelenggarakan seminar TA?","Apa tahapan-tahapan yang perlu diperhatikan dalam mengadakan seminar?","Apa saja tahapan dalam melakukan seminar?","Apa saja proses yang harus dilewati mahasiswa pada tahap seminar?","Tahapan seminar TA apa saja?","Bagaimana langkah-langkah pelaksanaan seminar TA?","Apa urutan tindakan yang harus diikuti dalam penyelenggaraan seminar TA?","Tahapan apa saja yang terlibat dalam menjalankan prosedur seminar TA?","Apa langkah-langkah esensial yang harus ditempuh dalam menyelenggarakan seminar TA?","Bagaimana tahapan-tahapan dalam proses pelaksanaan seminar TA?","Apa yang perlu dipertimbangkan dalam melaksanakan seminar Tugas Akhir?","Tahapan apa yang harus dilalui mahasiswa saat mempersiapkan dan menyelenggarakan seminar TA?","Apa saja prosedur yang harus dipatuhi oleh mahasiswa dalam menjalankan tahapan seminar TA?","Bagaimana proses yang harus dijalani mahasiswa dalam mengadakan seminar TA?","Apa langkah-langkah penting dalam menjalankan tahapan seminar Tugas Akhir?"],
      "responses":[
          "pada tahapan seminar terdapat tiga proses yang harus dijalankan yaitu: 1) Seminar Proposal, 2) Seminar Kemajuan / Seminar Nasional, 3) Sidang Tugas Akhir / Ujian Sarjana"
      ]
    },
    {
      "tag":"seminar_proposal",
      "patterns":["Apa yang sebaiknya dipersiapkan sebelum mengadakan seminar proposal?", "Apa yang perlu dipersiapkan sebelum menyelenggarakan seminar proposal?", "Prosedur apa yang perlu diikuti sebelum menyelenggarakan seminar proposal?", "Apa yang seharusnya diperhatikan sebelum melaksanakan seminar proposal?", "Apa yang diperlukan untuk disiapkan sebelum menyelenggarakan seminar proposal?", "Apa yang harus disiapkan sebelum mengadakan seminar proposal?", "Sebelum menjalankan seminar proposal, apa yang perlu dipersiapkan?", "Apa tahapan yang perlu diikuti sebelum melaksanakan seminar proposal?", "Apa langkah-langkah yang harus dijalani sebelum pelaksanaan seminar proposal?", "Tahapan apa yang perlu dijalani sebelum mengadakan seminar proposal?", "Apa yang harus ditempuh sebagai langkah awal sebelum pelaksanaan seminar proposal?", "Apa persiapan yang disarankan sebelum menjalankan seminar proposal?", "Apa langkah-langkah yang perlu diperhatikan sebelum mengadakan seminar proposal?", "Bagaimana prosedur yang seharusnya dijalani sebelum menyelenggarakan seminar proposal?", "Apa yang harus diatur sebelum melakukan seminar proposal?", "Sebelum mengadakan seminar proposal, apa langkah yang harus dikerjakan terlebih dahulu?", "Apa saja yang seharusnya dipersiapkan sebelum melangsungkan seminar proposal?", "Sebelum menjalankan seminar proposal, hal-hal apa yang perlu mendapat perhatian?", "Apa yang perlu dilakukan sebelum menjalani tahapan seminar proposal?", "Apa yang perlu dipersiapkan sebelum mengikuti seminar proposal?","Sebelum mengadakan seminar proposal, apa yang harus dipikirkan dan disiapkan?", "Apa yang perlu dipertimbangkan sebelum melaksanakan seminar proposal?", "Apa yang harus diperiksa dan dipersiapkan sebelum menyelenggarakan seminar proposal?", "Sebelum menjalankan seminar proposal, apa yang sebaiknya direncanakan?", "Apa persiapan yang seharusnya dijalani sebelum pelaksanaan seminar proposal?", "Apa yang perlu dipelajari sebelum mengikuti tahapan seminar proposal?", "Sebelum melaksanakan seminar proposal, apa yang harus diperhatikan dan dilakukan?", "Apa langkah-langkah yang penting untuk diambil sebelum mengadakan seminar proposal?", "Apa yang perlu diperhatikan dalam merencanakan seminar proposal?", "Sebelum menjalankan seminar proposal, apa yang perlu dikoordinasikan dan dikoherenkan?", "Apa yang seharusnya menjadi fokus dalam persiapan sebelum pelaksanaan seminar proposal?", "Sebelum mengadakan seminar proposal, apa yang harus dikoordinasikan dengan baik?", "Apa yang perlu diperiksa dan dipersiapkan dengan cermat sebelum mengadakan seminar proposal?", "Sebelum melaksanakan seminar proposal, apa yang harus diorganisir dengan baik?", "Apa yang sebaiknya dipersiapkan dan dipelajari sebelum mengikuti tahapan seminar proposal?", "Sebelum menjalankan seminar proposal, apa yang perlu dipelajari dan direncanakan?", "Apa yang harus dipikirkan dan dikerjakan sebelum mengikuti tahapan seminar proposal?", "Sebelum mengadakan seminar proposal, apa yang harus dikoordinasikan dan direncanakan dengan baik?", "Apa yang perlu diperhatikan dalam merencanakan serta mempersiapkan seminar proposal?", "Sebelum melaksanakan seminar proposal, apa yang perlu direncanakan dan dikoordinasikan?", "Apa yang harus dipertimbangkan dan direncanakan secara matang sebelum mengadakan seminar proposal?"],
      "responses":[
          "Dalam Tahap I ini mahasiswa harus sudah siap dengan materi yang akan disampaikan, dengan mempresentasikan latar belakang masalah, tujuan Tugas Akhir, metode yang akan digunakan serta tinjauan pustaka yang digunakan."
      ]
    },
    {
      "tag":"tata_tertib_sempro",
      "patterns":["Bagaimana tata tertib pelaksanaan seminar proposal?", "Bagaimana jalannya acara dalam seminar proposal?", "Bagaimana rincian tata tertib untuk seminar proposal?", "Apa aturan yang harus diikuti dalam pelaksanaan seminar proposal?", "Bagaimana tata tertib pelaksanaan seminar proposal?", "Apa hal-hal penting yang perlu diperhatikan saat menyelenggarakan seminar proposal?", "Bagaimana tata tertib dalam seminar proposal?", "Bagaimana proses pelaksanaan acara seminar proposal?", "Bagaimana prosedur yang harus diikuti dalam menjalankan seminar proposal?", "Apa langkah-langkah yang perlu diperhatikan saat mengadakan acara seminar proposal?", "Apa yang harus dipersiapkan sebelum mengikuti acara seminar proposal?", "Bagaimana urutan jalannya acara saat seminar proposal?", "Apa saja yang perlu diperhatikan dalam menjalankan tata tertib seminar proposal?", "Bagaimana proses pelaksanaan acara saat seminar proposal?", "Apa aturan yang berlaku dalam pelaksanaan seminar proposal?", "Apa yang menjadi fokus utama dalam pelaksanaan acara seminar proposal?", "Bagaimana tata cara yang harus dijalankan dalam menyelenggarakan seminar proposal?", "Apa yang perlu diikuti dalam menjalankan proses acara seminar proposal?","Bagaimana langkah-langkah yang harus diikuti dalam tata tertib seminar proposal?", "Apa saja tahapan yang harus dijalani dalam menjalankan acara seminar proposal?", "Bagaimana tata tertib yang perlu diikuti dalam seminar proposal?", "Apa yang sebaiknya diperhatikan dalam mengatur jalannya acara seminar proposal?", "Bagaimana cara menjalankan tata tertib seminar proposal dengan efektif?", "Apa yang harus diprioritaskan dalam menjalankan proses seminar proposal?", "Bagaimana cara memastikan pelaksanaan seminar proposal sesuai dengan aturan yang berlaku?", "Apa saja poin penting yang perlu diperhatikan saat mengikuti tata tertib seminar proposal?", "Bagaimana cara menjalankan proses pelaksanaan acara seminar proposal dengan lancar?", "Apa yang perlu dilakukan untuk memastikan keberhasilan seminar proposal sesuai tata tertibnya?", "Bagaimana langkah-langkah yang harus diambil untuk menjalankan tata tertib seminar proposal dengan sukses?", "Apa yang perlu diperhatikan agar proses pelaksanaan seminar proposal berjalan sesuai dengan tata tertib yang ditetapkan?", "Bagaimana cara menghindari pelanggaran tata tertib dalam pelaksanaan seminar proposal?", "Apa yang seharusnya menjadi perhatian utama dalam menjalankan aturan seminar proposal?", "Bagaimana cara mempersiapkan diri untuk menjalankan tata tertib seminar proposal dengan baik?", "Apa yang harus dipahami oleh setiap peserta mengenai tata tertib dalam seminar proposal?", "Bagaimana cara memastikan semua komponen acara terlaksana sesuai dengan tata tertib seminar proposal?", "Apa yang menjadi landasan utama dalam menjalankan tata tertib pelaksanaan seminar proposal?", "Bagaimana cara menjaga keteraturan acara seminar proposal sesuai dengan tata tertibnya?", "Apa yang perlu diingat oleh semua pihak agar seminar proposal berjalan sukses sesuai dengan tata tertib yang telah ditetapkan?"],
      "responses":[
          "Seminar Proposal ini bersifat tertutup untuk mahasiswa yang telah mengambil KRS TA, dihadiri oleh 2 pembimbing dan 3 penguji dengan susunan 1 ketua penguji dan 2 anggota penguji."
      ]
    },
    {
      "tag":"tata_cara_presentasi_sempro",
      "patterns":["bagaimana tata cara presentasi pada seminar proposal ?","Apa langkah-langkah presentasi yang perlu diikuti dalam seminar proposal?","Apa instruksi dalam melakukan presentasi pada seminar proposal?","Seperti apa teknik presentasi pada seminar proposal?","Tata cara dalam presesntasi seminar proposal","Bagaimana cara melakukan presentasi seminar proposal yang benar","Bagaimana langkah-langkah yang harus dijalani dalam melakukan presentasi seminar proposal?","Apa panduan yang perlu diikuti saat melakukan presentasi dalam seminar proposal?","Seperti apa strategi efektif dalam melakukan presentasi pada seminar proposal?","Bagaimana teknik yang tepat untuk menyampaikan presentasi saat seminar proposal?","Apa saja langkah yang perlu diperhatikan dalam tata cara presentasi pada seminar proposal?","Bagaimana cara terbaik untuk melakukan presentasi dalam konteks seminar proposal?","Apa instruksi khusus yang harus diikuti dalam presentasi saat seminar proposal?","Bagaimana metode yang paling sesuai untuk mempresentasikan ide pada seminar proposal?","Tata cara seperti apa yang sebaiknya digunakan dalam proses presentasi seminar proposal?","Apa tips penting dalam melakukan presentasi seminar proposal yang efektif?"],
      "responses":[
          "Tata cara presentasi tahap I Tugas Akhir atau seminar proposal Tugas Akhir adalah sebagai berikut : a. Presentasi dibuka oleh Ketua Penguji b. Ketua penguji menjelaskan tahapan sidang proposal : 1) Sesi presentasi 15 menit, 2) Sesi tanya jawab, 3) Rapat dewan penguji dan pembimbing untuk penentuan apakah proposal yang diajukan Lulus / Tidak Lulus."
      ]
    },
    {
      "tag":"ketentuan_sempro_lulus",
      "patterns":["apa yang harus dilakukan setelah mahasiswa dinyatakan Lulus pada seminar proposal ?","Apa langkah selanjutnya setelah mahasiswa berhasil lulus pada seminar proposal?","Apa saja hal yang perlu dilakukan setelah mahasiswa berhasil melewati seminar proposal?","Bagaimana prosedur setelah mahasiswa dinyatakan lulus pada seminar proposal?","Setelah lulus dalam seminar proposal, apa yang harus dilakukan selanjutnya?","Apa yang harus dilakukan jika lulus sempro","jika mahasiswa lulus pada tahap seminar proposal, apa yang harus dilakukan","Setelah mahasiswa dinyatakan lulus pada seminar proposal, apa tindakan yang perlu diambil?","Apa langkah-langkah yang harus diambil setelah berhasil melewati seminar proposal?","Bagaimana proses lanjutan setelah mahasiswa berhasil lulus pada tahap seminar proposal?","Setelah berhasil melewati seminar proposal, apa yang harus dilakukan selanjutnya oleh mahasiswa?","Apa langkah yang perlu dipersiapkan oleh mahasiswa setelah sukses lulus dalam seminar proposal?","Setelah mencapai kelulusan dalam seminar proposal, apa rencana langkah berikutnya yang harus dijalani?","Bagaimana prosedur tindak lanjut setelah mahasiswa dinyatakan lulus pada seminar proposal?","Setelah berhasil melewati tahap seminar proposal, apa langkah selanjutnya yang harus dilakukan mahasiswa?","Apa tugas yang harus diselesaikan mahasiswa setelah berhasil lulus dalam seminar proposal?","Setelah mahasiswa dinyatakan lulus pada tahap seminar proposal, bagaimana rencana tindak lanjut yang sebaiknya diambil?"],
      "responses":[
          "Apabila mahasiswa dinyatakan Lulus pada seminar proposal, maka mahasiswa : a. Melakukan proses revisi proposal yang disahkan oleh Dosen Penguji, Dosen Pembimbing dan Koordinator TA b. Proposal TA yang sudah disahkan, kemudian : 1) Dijilid softcover dengan menggunakan warna orange (warna sesuai dengan warna cover resmi FTI), 2) Digandakan sebanyak 2 (dua eksemplar (diprint bukan di fotokopi & lembar pengesahan asli), 3) Dikumpulkan ke admin TA c. Melanjutkan ke tahap selanjutnya yaitu penyusunan Tugas Akhir (bimbingan pra seminar kemajuan) d. Proses bimbingan WAJIB didokumentasikan pada Log Book Pra Seminar Kemajuan"
      ]
    },
    {
      "tag":"ketentuan_sempro_tidak_lulus",
      "patterns":["Jika tidak lulus dalam seminar proposal, langkah apa yang sebaiknya diambil oleh mahasiswa?", "Setelah tidak berhasil dalam seminar proposal, apa tindakan yang perlu dilakukan oleh mahasiswa?", "Bagaimana langkah selanjutnya bagi mahasiswa yang dinyatakan tidak lulus dalam seminar proposal?", "Apabila gagal dalam seminar proposal, langkah apa yang harus diambil oleh mahasiswa?", "Jika dinyatakan tidak lulus dalam seminar proposal, apa tindakan yang seharusnya diambil oleh mahasiswa?", "Jika tidak lulus pada seminar proposal, apa yang seharusnya dilakukan?", "Apa yang perlu dilakukan jika tidak lulus pada seminar proposal?", "Setelah tidak berhasil dalam seminar proposal, langkah apa yang seharusnya diambil oleh mahasiswa?", "Bagaimana tindakan yang harus dilakukan oleh mahasiswa setelah tidak lulus dalam seminar proposal?", "Jika dinyatakan tidak lulus dalam seminar proposal, langkah apa yang sebaiknya diambil oleh mahasiswa?", "Apabila gagal dalam seminar proposal, apa rencana langkah selanjutnya yang perlu diambil oleh mahasiswa?", "Jika tidak lulus pada seminar proposal, tindakan apa yang sebaiknya diambil oleh mahasiswa?", "Setelah tidak berhasil dalam seminar proposal, apa yang seharusnya dilakukan oleh mahasiswa?", "Jika mahasiswa tidak lulus pada tahap seminar proposal, apa tindakan yang sebaiknya diambil?", "Apa langkah yang perlu dipertimbangkan oleh mahasiswa jika tidak berhasil dalam seminar proposal?", "Bagaimana rencana tindak lanjut bagi mahasiswa yang dinyatakan tidak lulus dalam seminar proposal?", "Jika tidak lulus dalam seminar proposal, langkah apa yang harus dipertimbangkan oleh mahasiswa?","Setelah tidak berhasil melewati seminar proposal, apa langkah yang disarankan bagi mahasiswa?", "Jika tidak lulus dalam seminar proposal, apa yang sebaiknya direncanakan untuk langkah selanjutnya?", "Apabila tidak berhasil melewati seminar proposal, tindakan apa yang perlu diambil oleh mahasiswa?", "Jika mahasiswa tidak lulus dalam seminar proposal, apa rencana yang sebaiknya dipertimbangkan?", "Setelah tidak lulus dalam evaluasi seminar proposal, langkah apa yang harus ditempuh oleh mahasiswa?", "Jika dinyatakan tidak berhasil dalam seminar proposal, tindakan apa yang seharusnya dilakukan oleh mahasiswa?", "Bagaimana langkah yang harus diambil oleh mahasiswa setelah tidak lulus dalam seminar proposal?", "Setelah gagal dalam seminar proposal, apa yang perlu diatur oleh mahasiswa?", "Jika tidak lulus pada tahap seminar proposal, apa tindakan yang sebaiknya diprioritaskan oleh mahasiswa?", "Apabila tidak berhasil dalam evaluasi seminar proposal, langkah apa yang sebaiknya dijalankan oleh mahasiswa?", "Jika mahasiswa tidak lulus dalam seminar proposal, apa tindakan yang harus ditempuh?", "Setelah tidak berhasil dalam seminar proposal, apa rencana tindak lanjut yang seharusnya diambil oleh mahasiswa?", "Jika dinyatakan tidak lulus dalam evaluasi seminar proposal, langkah apa yang sebaiknya diambil oleh mahasiswa?", "Bagaimana tindakan yang perlu dipersiapkan oleh mahasiswa setelah tidak berhasil dalam seminar proposal?", "Jika tidak lulus pada tahap seminar proposal, langkah apa yang perlu dipikirkan oleh mahasiswa?", "Apabila gagal dalam seminar proposal, apa yang harus dilakukan oleh mahasiswa sebagai reaksi awal?", "Setelah tidak berhasil melewati evaluasi seminar proposal, apa langkah selanjutnya yang perlu ditempuh oleh mahasiswa?", "Jika mahasiswa tidak lulus dalam seminar proposal, apa strategi yang perlu dijalankan?", "Setelah dinyatakan tidak berhasil dalam seminar proposal, bagaimana langkah yang seharusnya diambil oleh mahasiswa?", "Jika tidak lulus dalam tahap seminar proposal, apa langkah yang sebaiknya diambil untuk perbaikan?", "Apabila tidak berhasil dalam evaluasi seminar proposal, tindakan apa yang sebaiknya dipikirkan oleh mahasiswa?"],
      "responses":[
          "Apabila mahasiswa dinyatakan Tidak Lulus pada seminar proposal, maka mahasiswa wajib mengulang Seminar Proposal dengan terlebih dahulu melakukan perbaikan sesuai dengan arahan dosen penguji."
      ]
    },
    {
      "tag":"sebelum_seminar_kemajuan",
      "patterns":["apa saja persyaratan sebelum melaksanakan seminar kemajuan ?","Apa persyaratan sebelum melaksanakan seminar kemajuan?","Bagaimana syarat-syarat sebelum penyelenggaraan seminar kemajuan?","Apa persyaratan sebelum melaksanakan seminar kemajuan?","Apa yang perlu dipersiapkan sebelum melaksanakan seminar kemajuan?","Persyaratan sebelum seminar kemajuan apa saja?","Sebelum melaksanakan seminar kemajuan apa yang harus dilakukan?","Syrat sebelum melaksanakan seminar kemajuan","Apa saja persiapan yang harus dilakukan sebelum menyelenggarakan seminar kemajuan?","Bagaimana persyaratan yang perlu terpenuhi sebelum pelaksanaan seminar kemajuan?","Sebelum melaksanakan seminar kemajuan, apa syarat-syarat yang harus dipenuhi?","Apa persiapan yang perlu diperhatikan sebelum mengadakan seminar kemajuan?","Sebelum pelaksanaan seminar kemajuan, apa yang sebaiknya dipersiapkan terlebih dahulu?","Apa saja persyaratan yang harus dicapai sebelum menjalankan seminar kemajuan?","Bagaimana tata cara persiapan sebelum menyelenggarakan seminar kemajuan?","Sebelum melaksanakan seminar kemajuan, apa langkah yang harus ditempuh?","Apa persyaratan yang perlu dipenuhi sebelum mengikuti seminar kemajuan?","Sebelum seminar kemajuan dilaksanakan, apa yang harus dipersiapkan?","Apa saja persyaratan yang harus terpenuhi sebelum melaksanakan seminar kemajuan?","Sebelum mengadakan seminar kemajuan, apa persyaratan yang harus dicapai?","Bagaimana syarat-syarat yang perlu dipenuhi sebelum penyelenggaraan seminar kemajuan?","Apa yang perlu disiapkan sebelum melaksanakan seminar kemajuan?","Sebelum pelaksanaan seminar kemajuan, apa yang harus dipersiapkan terlebih dahulu?","Apa persiapan yang harus diperhatikan sebelum menyelenggarakan seminar kemajuan?","Sebelum mengikuti seminar kemajuan, apa persyaratan yang harus dicapai?","Apa langkah yang harus ditempuh sebelum melaksanakan seminar kemajuan?","Bagaimana tata cara persiapan sebelum menyelenggarakan seminar kemajuan?","Sebelum pelaksanaan seminar kemajuan, apa langkah yang perlu dijalani?","Apa yang harus dipersiapkan sebelum mengikuti seminar kemajuan?","Sebelum seminar kemajuan dilaksanakan, apa yang perlu diperhatikan?","Apa persyaratan yang harus terpenuhi sebelum penyelenggaraan seminar kemajuan?","Sebelum melaksanakan seminar kemajuan, apa yang perlu dilakukan?","Apa persiapan yang harus dicapai sebelum mengadakan seminar kemajuan?","Sebelum pelaksanaan seminar kemajuan, apa persyaratan yang harus dipenuhi?","Apa saja langkah yang perlu diambil sebelum mengikuti seminar kemajuan?","Bagaimana persyaratan yang harus diperhatikan sebelum pelaksanaan seminar kemajuan?","Sebelum menyelenggarakan seminar kemajuan, apa persiapan yang perlu dilakukan?","Apa yang perlu terpenuhi sebelum melaksanakan seminar kemajuan?"],
      "responses":[
          "Adapun syarat melaksanakan Tahap II adalah: a. Telah Lulus Tahap I. b. Draft Laporan dan Makalah Tugas Akhir sudah disetujui dan ditandatangi oleh kedua pembimbing. c. Telah disetujui oleh Koordinator Tugas Akhir. d. Membuat poster ukuran A3. e. Menunjukkan prosentase plagiat dibawah 25% dengan lampiran dari Turnitin. f. Syarat administrasi lengkap dapat dilihat pada Lampiran 5"
      ]
    },
    {
      "tag":"plaksanaan_seminar_kemajuan",
      "patterns":["bagaimana tata cara pelaksanaan seminar kemajuan ?","tata cara seminar kemajuan?","Tata cara pelaksanaan seminar kemajuan?","Cara menyelenggarakan seminar kemajuan?","Langkah-langkah melaksanakan seminar kemajuan?","Prosedur mengadakan seminar kemajuan?","Hal yang perlu diperhatikan dalam pelaksanaan seminar kemajuan?","Persyaratan untuk menjalankan seminar kemajuan?","Syarat melaksanakan seminar kemajuan apa saja?","Apa saja syrat untuk melaksanakan seminar kemajuan","Bagaimana langkah-langkah dalam menyelenggarakan seminar kemajuan?","Apa urutan prosedur yang harus diikuti dalam pelaksanaan seminar kemajuan?","Sebelum melaksanakan seminar kemajuan, apa tindakan yang sebaiknya dilakukan?","Bagaimana aturan dalam menjalankan seminar kemajuan?","Apa prosedur yang perlu dijalani dalam pelaksanaan seminar kemajuan?","Tata tertib pelaksanaan seminar kemajuan seperti apa?","Apa yang harus diperhatikan saat mengadakan seminar kemajuan?","Bagaimana cara efektif menyelenggarakan seminar kemajuan?","Apa langkah-langkah penting dalam pelaksanaan seminar kemajuan?","Sebelum melaksanakan seminar kemajuan, apa persyaratan yang harus dipenuhi?","Bagaimana tata cara pelaksanaan seminar kemajuan?","Tata cara seminar kemajuan seperti apa?","Apa langkah-langkah dalam menyelenggarakan seminar kemajuan?","Cara menyelenggarakan seminar kemajuan dengan efektif?","Langkah-langkah penting dalam pelaksanaan seminar kemajuan?","Apa yang harus diperhatikan saat mengadakan seminar kemajuan?","Bagaimana aturan yang harus diikuti dalam menjalankan seminar kemajuan?","Apa urutan prosedur yang perlu dijalani dalam pelaksanaan seminar kemajuan?","Tata tertib pelaksanaan seminar kemajuan bagaimana?","Apa yang harus dipersiapkan sebelum melaksanakan seminar kemajuan?","Apa prosedur yang harus dilalui dalam pelaksanaan seminar kemajuan?","Apa langkah-langkah yang perlu diikuti dalam pelaksanaan seminar kemajuan?","Sebelum melaksanakan seminar kemajuan, apa tindakan yang sebaiknya dilakukan?","Apa yang perlu diperhatikan dalam proses pelaksanaan seminar kemajuan?","Bagaimana cara efektif menyelenggarakan seminar kemajuan?","Apa yang harus diatur dalam tata tertib pelaksanaan seminar kemajuan?","Apa persyaratan yang perlu dipenuhi sebelum melaksanakan seminar kemajuan?","Apa syarat yang harus dipenuhi dalam pelaksanaan seminar kemajuan?","Apa prosedur yang perlu dijalani saat mengadakan seminar kemajuan?","Bagaimana langkah-langkah yang harus diambil dalam pelaksanaan seminar kemajuan?"],
      "responses":[
          "Tata cara pelaksanaan Seminar Kemajuan adalah sebagai berikut :a. Seminar dilaksanakan bersama-sama dalam forum seminar internal atau seminar nasional, b. Draft laporan TA digandakan sebanyak 2 Exemplar, c. Makalah digandakan sesuai dengan jumlah peserta, d. Minimal dihadiri oleh salah satu Pembimbing"
      ]
    },
    {
      "tag":"ketentuan_seminar_kemajuan_lulus",
      "patterns":["Setelah mahasiswa lulus pada seminar kemajuan, langkah apa yang perlu diambil?", "Setelah berhasil lulus seminar kemajuan, tindakan apa yang harus dilakukan selanjutnya?", "Setelah sukses dalam seminar kemajuan, apa tindakan yang sebaiknya dijalankan?", "Setelah mencapai hasil positif dalam seminar kemajuan, apa langkah yang harus diambil selanjutnya?", "Setelah mahasiswa dinyatakan lulus dalam seminar kemajuan, langkah apa yang seharusnya dipersiapkan untuk tahap selanjutnya?", "Setelah mencapai hasil sukses dalam seminar kemajuan, apa langkah yang harus dijalankan setelahnya?", "Setelah lulus seminar kemajuan, apa langkah selanjutnya yang sebaiknya diambil?", "Prosedur setelah lulus seminar kemajuan?", "Setelah berhasil lulus seminar kemajuan, tindakan apa yang disarankan?", "Apa yang perlu dilakukan oleh mahasiswa setelah berhasil meraih hasil positif pada seminar kemajuan?", "Setelah mahasiswa dinyatakan lulus dalam seminar kemajuan, apa persiapan yang diperlukan untuk langkah berikutnya?", "Setelah mencapai hasil sukses dalam seminar kemajuan, langkah apa yang perlu ditempuh selanjutnya?", "Setelah berhasil melewati tahap seminar kemajuan, apa tindakan berikutnya yang sebaiknya diambil?", "Apa tindakan yang harus dijalankan setelah mahasiswa dinyatakan lulus dalam seminar kemajuan?", "Bagaimana prosedur lanjutan setelah berhasil lulus dalam seminar kemajuan?", "Setelah berhasil melewati seminar kemajuan, langkah apa yang seharusnya diambil berikutnya?", "Apa langkah yang sebaiknya dilakukan oleh mahasiswa setelah berhasil sukses dalam seminar kemajuan?", "Setelah mendapatkan hasil positif dari seminar kemajuan, apa yang harus dipersiapkan untuk tahap selanjutnya?","Setelah berhasil melewati evaluasi seminar kemajuan, apa langkah selanjutnya yang direkomendasikan?", "Setelah berhasil lulus ujian seminar kemajuan, apa yang sebaiknya dilakukan?", "Setelah berhasil melewati tahap presentasi seminar kemajuan, apa yang harus dijalankan?", "Apa langkah-langkah yang seharusnya diambil setelah mahasiswa dinyatakan berhasil dalam seminar kemajuan?", "Setelah berhasil lulus seminar kemajuan, apa yang perlu diatur selanjutnya?", "Setelah mahasiswa mencapai hasil positif pada seminar kemajuan, apa yang perlu dipersiapkan untuk langkah berikutnya?", "Setelah berhasil lulus ujian seminar kemajuan, apa persiapan yang perlu dilakukan untuk langkah selanjutnya?", "Setelah sukses dalam presentasi seminar kemajuan, apa langkah yang harus diambil?", "Setelah mahasiswa dinyatakan lulus dalam seminar kemajuan, tindakan apa yang disarankan untuk diambil?", "Apa yang sebaiknya dilakukan oleh mahasiswa setelah berhasil melewati ujian seminar kemajuan?", "Setelah mendapatkan hasil positif dalam presentasi seminar kemajuan, apa tindakan yang seharusnya dijalankan selanjutnya?", "Setelah berhasil melewati evaluasi seminar kemajuan, apa yang perlu dipertimbangkan untuk langkah berikutnya?", "Setelah berhasil lulus presentasi seminar kemajuan, langkah apa yang seharusnya diprioritaskan?", "Apa yang seharusnya dijadikan fokus setelah berhasil melewati tahap evaluasi seminar kemajuan?", "Setelah mencapai hasil sukses pada presentasi seminar kemajuan, apa langkah yang perlu dilakukan?", "Setelah mahasiswa dinyatakan berhasil dalam seminar kemajuan, apa tindakan yang sebaiknya ditempuh?", "Apa yang disarankan untuk dilakukan oleh mahasiswa setelah berhasil lulus presentasi seminar kemajuan?", "Setelah mendapatkan hasil positif dari evaluasi seminar kemajuan, apa yang harus diperhatikan dalam langkah selanjutnya?", "Setelah berhasil melewati tahap ujian seminar kemajuan, apa yang sebaiknya diatur?", "Setelah mahasiswa dinyatakan lulus dalam evaluasi seminar kemajuan, tindakan apa yang perlu dipersiapkan?", "Apa langkah yang seharusnya diambil oleh mahasiswa setelah berhasil melewati presentasi seminar kemajuan?"],
      "responses":[
          "Apabila mahasiswa dinyatakan Lulus pada seminar kemajuan, maka mahasiswa :a. Wajib melakukan perbaikan terhadap laporan dan produk TA sesuai dengan arahan dari dosen pembimbing saat seminar kemajuan (lihat lembar revisi), b. Selama proses bimbingan perbaikan, mahasiswa WAJIB mengisi Log Book Pra Sidang Tugas Akhir, c. Dosen pembimbing masing-masing akan melakukan evaluasi terhadap hasil perbaikan laporan dan produk TA untuk dipertimbangkan melanjutkan pada Ujian Sarjana"
      ]
    },
    {
      "tag":"ketentuan_seminar_kemajuan_tidak_lulus",
      "patterns":["apa yang harus dilakukan mahasiswa jika pada seminar kemajuan dinyatakan tidak lulus?","Setelah tidak lulus pada seminar kemajuan, apa tindakan yang harus diambil oleh mahasiswa?","jika tidak lulus seminar kemajuan, apa yang harus dilakukan?","Bagaimana langkah selanjutnya jika mahasiswa dinyatakan tidak lulus dalam seminar kemajuan?","Jika gagal pada seminar kemajuan, apa yang perlu dilakukan oleh mahasiswa?","Jika dinyatakan tidak lulus dalam seminar kemajuan, apa yang harus dilakukan oleh mahasiswa?","Bagaimana jika tidak lulus seminar kemajuan?","Apa yang harus dilakukan jika tidak lulus seminar kemajuan?","Jika tidak berhasil melewati seminar kemajuan, langkah apa yang seharusnya diambil oleh mahasiswa?","Setelah dinyatakan tidak lulus pada seminar kemajuan, apa tindakan yang disarankan untuk dilakukan oleh mahasiswa?","Bagaimana rencana tindakan yang harus diambil jika mahasiswa tidak lulus dalam seminar kemajuan?","Jika tidak berhasil pada seminar kemajuan, langkah selanjutnya yang perlu diambil oleh mahasiswa apa?","Setelah mendapat hasil negatif pada seminar kemajuan, apa yang harus dilakukan oleh mahasiswa?","Jika dinyatakan tidak lulus dalam seminar kemajuan, langkah apa yang harus dipertimbangkan oleh mahasiswa?","Apa yang perlu dilakukan oleh mahasiswa jika tidak lulus pada seminar kemajuan?","Jika tidak berhasil dalam seminar kemajuan, bagaimana langkah-langkah yang sebaiknya diambil oleh mahasiswa?","Setelah gagal dalam seminar kemajuan, tindakan apa yang seharusnya dilakukan oleh mahasiswa?","Jika mahasiswa tidak lulus pada seminar kemajuan, bagaimana langkah berikutnya yang harus dijalankan?","Apabila hasil seminar kemajuan tidak memuaskan, langkah apa yang harus diambil oleh mahasiswa?","Bagaimana mahasiswa sebaiknya bertindak jika dinyatakan tidak lulus dalam seminar kemajuan?","Jika hasil seminar kemajuan tidak memuaskan, apa tindakan yang disarankan untuk dilakukan oleh mahasiswa?","Setelah mendapat hasil negatif dalam seminar kemajuan, apa langkah selanjutnya yang perlu diambil oleh mahasiswa?","Apabila mahasiswa tidak berhasil melewati seminar kemajuan, bagaimana rencana tindakan yang sebaiknya diambil?"],
      "responses":[
          "Apabila mahasiswa dinyatakan Tidak Lulus pada Seminar Kemajuan, maka mahasiswa wajib mengulang Seminar Kemajuan dengan terlebih dahulu melakukan perbaikan sesuai dengan arahan dosen pembimbing."
      ]
    },
    {
      "tag":"sidang",
      "patterns":["Bagaimana langkah-langkah dalam melakukan pendaftaran Sidang Tugas Akhir?","Apa prosedur yang harus diikuti untuk mendaftar Sidang TA?","Cara harus dilakukan untuk mendaftar Sidang Tugas Akhir?","Bagaimana cara pendaftaran Sidang TA?","Apa langkah-langkah yang perlu diikuti dalam pendaftaran Sidang Tugas Akhir?","Apa yang perlu dilakukan saat mendaftar Sidang Tugas Akhir?","Bagaimana prosedur pendaftaran untuk Sidang Tugas Akhir?","Apa tahapan yang harus dilalui dalam proses pendaftaran Sidang Tugas Akhir?","Apa persyaratan yang harus dipenuhi saat mendaftar Sidang TA?","Apa saja syarat dalam pendaftaran Sidang Tugas Akhir?","Bagaimana cara mendaftar sidang Tugas Akhir atau TA?","Bagaimana tahapan dalam proses mendaftarkan diri untuk Sidang Tugas Akhir?","Apa urutan langkah-langkah yang harus diikuti untuk mendaftar Sidang TA?","Cara apa yang harus ditempuh untuk melakukan pendaftaran Sidang Tugas Akhir?","Bagaimana langkah-langkah yang perlu dipatuhi saat ingin mendaftar Sidang Tugas Akhir?","Apa yang harus dilakukan saat ingin mendaftar untuk Sidang Tugas Akhir?","Bagaimana prosedur yang harus dilalui dalam pendaftaran Sidang TA?","Apa persyaratan yang wajib dipenuhi saat hendak mendaftar Sidang Tugas Akhir?","Langkah apa yang perlu dijalani dalam proses pendaftaran untuk Sidang Tugas Akhir?","Apa saja syarat yang harus terpenuhi ketika hendak mendaftarkan diri untuk Sidang TA?","Bagaimana langkah yang harus diikuti dalam mengajukan pendaftaran untuk Sidang Tugas Akhir atau TA?","Bagaimana caranya untuk mendaftar Sidang Tugas Akhir atau TA?","Apa tahapan yang harus dilalui saat ingin mendaftar untuk Sidang Tugas Akhir?","Cara apa yang harus diikuti dalam proses pendaftaran Sidang TA?","Apa urutan langkah-langkah yang perlu dipatuhi ketika hendak mendaftarkan diri untuk Sidang Tugas Akhir?","Bagaimana langkah-langkah yang perlu dijalani dalam mengajukan pendaftaran untuk Sidang Tugas Akhir atau TA?"],
      "responses":[
          "Proses pendaftaran dari Sidang TA / Ujian Sarjana adalah sebagai berikut : a. Mengisi formulir pendaftaran tugas akhir yang dilampiri dengan dokumen-dokumen syarat sidang tugas akhir (lihat Lampiran 7), b. Mahasiswa membawa seluruh dokumen untuk divalidasikan kepada Koordinator TA, Kaprodi dan Sekprodi. Sebelum di validasi, laporan TA harus sudah di ACC dan ditandatangani oleh kedua pembimbing, c. Setelah seluruh dokumen divalidasi dan dinyatakan lengkap dan layak, koordinator TA akan menjadwalkan pelaksanaan ujian sarjana serta menentukan calon penguji, d. Pada jadwal yang telah ditentukan, mahasiswa melaksanakan ujian sarjana sesuai dengan aturan dan tata tertib yang telah ditentukan, e. Ketentuan Sidang Tugas Akhir secara lengkap dijelaskan pada Sub Bab 1.6 Tata Tertib Ujian Sarjana / Sidang Tugas Akhir"
      ]
    },
    {
      "tag":"pasca_sidang",
      "patterns":["Tindakan apa yang diambil setelah sidang?","Langkah apa yang harus diambil usai sidang?","Bagaimana proses setelah mengikuti sidang?","Apa yang harus dilakukan setelah sidang selesai?","Hal apa yang perlu diselesaikan usai sidang?","Apa yang harus diurus setelah sidang?","Langkah apa yang diambil mahasiswa setelah sidang?","Bagaimana tindakan mahasiswa setelah sidang?","Apa prosedur pasca sidang bagi mahasiswa?","Apa yang perlu diperhatikan oleh mahasiswa setelah sidang?","Apa yang perlu diatur oleh mahasiswa usai sidang?","Setelah sidang, langkah apa yang perlu dilakukan?","Apa yang seharusnya dilakukan setelah sidang berlangsung?","Bagaimana proses lanjutan setelah sidang selesai?","Tindakan apa yang sebaiknya diambil usai sidang?","Setelah sidang berakhir, hal-hal apa yang perlu diselesaikan?","Apa yang menjadi fokus tindakan setelah sidang selesai?","Bagaimana langkah konkret yang diambil oleh mahasiswa setelah sidang?","Usai sidang, bagaimana langkah selanjutnya yang harus diambil oleh mahasiswa?","Apa prosedur yang harus dijalani oleh mahasiswa pasca sidang?","Apa yang harus diperhatikan oleh mahasiswa setelah menyelesaikan sidang?","Setelah sidang, langkah apa yang seharusnya dilaksanakan?","Apa yang sebaiknya dikerjakan setelah sidang berlangsung?","Usai sidang, tindakan apa yang perlu dilakukan?","Setelah sidang berakhir, apa yang menjadi langkah selanjutnya?","Bagaimana proses setelah sidang selesai dan apa yang harus dilakukan?","Apa yang harus diselesaikan setelah sidang?","Tindakan konkret apa yang diambil setelah sidang usai?","Setelah mengikuti sidang, bagaimana langkah-langkah yang harus diambil?","Apa langkah berikutnya setelah sidang telah selesai?","Bagaimana prosedur pasca sidang bagi mahasiswa?","Apa yang perlu diperhatikan oleh mahasiswa setelah menyelesaikan sidang?","Apa hal-hal yang harus diatur oleh mahasiswa usai sidang?","Setelah sidang, apa fokus tindakan yang harus dilakukan?","Apa tindakan yang seharusnya diambil oleh mahasiswa usai sidang?","Setelah sidang, apa tugas yang harus diselesaikan?","Bagaimana langkah konkret yang diambil oleh mahasiswa setelah sidang?","Apa yang menjadi prioritas tindakan usai sidang?","Setelah sidang berlangsung, apa yang harus dipersiapkan selanjutnya?","Apa yang diharapkan dilakukan oleh mahasiswa setelah sidang?","Bagaimana proses lanjutan yang harus dijalani setelah sidang selesai?","Apa langkah-langkah yang sebaiknya dijalankan pasca sidang?","Setelah sidang selesai, apa tindakan yang perlu dilakukan?","Bagaimana proses lanjutan setelah keluar dari sidang?","Apa yang seharusnya dilaksanakan setelah menyelesaikan sidang?","Setelah sidang berakhir, apa yang menjadi fokus penyelesaian?","Apa yang perlu diurus setelah keluar dari ruang sidang?","Langkah apa yang sebaiknya diambil oleh mahasiswa usai sidang?","Bagaimana tindakan konkret mahasiswa setelah mengikuti sidang?","Apa prosedur yang perlu ditempuh mahasiswa setelah sidang?","Apa hal-hal yang harus diperhatikan oleh mahasiswa usai sidang?","Setelah sidang selesai, langkah apa yang perlu diambil?","Bagaimana proses setelah mengikuti sidang dan apa yang harus dilakukan?","Apa tindakan yang sebaiknya dilakukan usai keluar dari ruang sidang?","Setelah sidang berakhir, apa yang menjadi fokus penyelesaian?","Bagaimana langkah konkret yang harus diambil oleh mahasiswa setelah selesai sidang?","Setelah mengikuti sidang, apa langkah-langkah yang perlu ditempuh mahasiswa selanjutnya?","Apa yang diharapkan dilakukan oleh mahasiswa setelah menyelesaikan sidang?","Setelah sidang selesai, langkah apa yang perlu diambil?","Bagaimana proses setelah mengikuti sidang dan apa yang harus dilakukan?","Apa tindakan yang sebaiknya dilakukan usai keluar dari ruang sidang?","Setelah sidang berakhir, apa yang menjadi fokus penyelesaian?","Bagaimana langkah konkret yang harus diambil oleh mahasiswa setelah selesai sidang?","Setelah mengikuti sidang, apa langkah-langkah yang perlu ditempuh mahasiswa selanjutnya?","Setelah sidang berakhir, apa yang perlu diperhatikan dan diatur oleh mahasiswa?","Bagaimana tindakan konkret mahasiswa setelah mengikuti sidang?","Setelah sidang selesai, apa yang harus dipersiapkan selanjutnya?","Apa langkah berikutnya yang perlu diambil setelah keluar dari ruang sidang?","Bagaimana proses lanjutan setelah menyelesaikan sidang dan apa yang harus ditempuh?"],
      "responses":[
          "Mahasiswa yang sudah dinyatakan lulus dalam Sidang Tugas Akhir oleh tim penguji wajib menyusun dan mengumpulkan ; a. Laporan Tugas Akhir (hard copy) sebanyak 5 eksemplar. b. Laporan Tugas Akhir soft copy dengan format pdf dalam bentuk CD. c. Mengumpulkan dan menyerahkan 1 lembar pengesahan untuk masing-masing dosen pembimbing dan tim penguji. d. Mengisi dan memenuhi peryaratan kegiatan dan prestasi ekstra kurikuler seperti yang tertera pada www.sikape.unissula.ac.id"
      ]
    },
    {
      "tag":"wisuda",
      "patterns":["apa saja persyaratan mengikuti wisuda?","bagaimana cara mendaftar wisuda","apa saja syarat mengikuti wisuda sarjana?","Syarat harus dipenuhi untuk mengikuti wisuda?","Bagaimana prosedur pendaftaran untuk mengikuti acara wisuda sarjana?","Syarat mengikuti wisuda?","Apa persyaratan yang harus dipenuhi sebelum mengikuti prosesi wisuda?","Bagaimana langkah-langkah dalam mendaftar untuk mengikuti wisuda?","Apa saja kriteria yang perlu terpenuhi untuk mengikuti acara wisuda sarjana?","Bagaimana tata cara mendaftar dan memenuhi syarat untuk ikut wisuda?","Apa yang sebaiknya dipersiapkan sebelum mengikuti acara wisuda?","Bagaimana prosedur pendaftaran untuk menghadiri wisuda sarjana?","Apa persyaratannya jika ingin mengikuti acara wisuda?","Apa yang perlu diurus sebelum dapat mengikuti prosesi wisuda?","Bagaimana syarat yang harus dipenuhi agar dapat mengikuti upacara wisuda?","Apa saja ketentuan yang perlu diperhatikan sebelum mengikuti wisuda?","Apa persyaratan yang harus terpenuhi sebelum mengikuti acara wisuda?","Bagaimana langkah-langkah dalam mendaftar untuk menghadiri upacara wisuda?","Apa saja kriteria yang perlu dipenuhi agar dapat mengikuti acara wisuda sarjana?","Bagaimana tata cara mendaftar dan memenuhi syarat untuk ikut dalam upacara wisuda?","Apa yang sebaiknya dipersiapkan sebelum menghadiri acara wisuda?","Bagaimana prosedur pendaftaran untuk menghadiri upacara wisuda sarjana?","Apa persyaratannya jika ingin mengikuti acara wisuda?","Apa yang perlu diurus sebelum dapat menghadiri prosesi wisuda?","Bagaimana syarat yang harus dipenuhi agar bisa mengikuti acara wisuda?","Apa saja ketentuan yang perlu diperhatikan sebelum menghadiri acara wisuda?","Apa persyaratan yang harus dipenuhi sebelum mengikuti upacara wisuda?","Bagaimana langkah-langkah pendaftaran untuk mengikuti acara wisuda?","Apa saja syarat yang perlu terpenuhi sebelum mengikuti acara wisuda sarjana?","Bagaimana tata cara mendaftar dan memenuhi persyaratan untuk hadir dalam upacara wisuda?","Apa yang seharusnya disiapkan sebelum menghadiri acara wisuda?","Bagaimana prosedur pendaftaran untuk mengikuti upacara wisuda sarjana?","Apa persyaratannya jika ingin menghadiri acara wisuda?","Apa yang perlu dikelola sebelum bisa mengikuti prosesi wisuda?","Bagaimana syarat yang harus dipenuhi sebelum dapat hadir dalam acara wisuda?","Apa saja aturan yang harus diikuti sebelum menghadiri acara wisuda?","Apa persyaratan yang harus dipenuhi sebelum menghadiri acara wisuda?","Bagaimana cara mendaftar dan memenuhi syarat untuk mengikuti prosesi wisuda?","Apa langkah-langkah pendaftaran yang harus diambil agar bisa mengikuti acara wisuda?","Apa saja ketentuan yang perlu diperhatikan sebelum menghadiri acara wisuda?","Bagaimana tata cara mendaftar dan memastikan persyaratan terpenuhi untuk ikut dalam upacara wisuda?","Apa yang harus dikelola sebelum dapat hadir dalam acara wisuda?","Bagaimana syarat yang harus dipenuhi sebelum mengikuti prosesi wisuda?","Apa saja persyaratan yang harus dipenuhi sebelum menghadiri acara wisuda sarjana?","Bagaimana tata cara mendaftar dan memenuhi persyaratan untuk hadir dalam upacara wisuda?","Apa yang seharusnya dipersiapkan sebelum menghadiri acara wisuda?","Bagaimana prosedur pendaftaran untuk menghadiri upacara wisuda sarjana?"],
      "responses":[
          "Adapun syarat mengikuti wisuda sarjana adalah sebagai berikut : a. Membayar biaya wisuda Universitas dan Wisuda Fakultas, b. Mendaftar wisuda Universitas dan Fakultas dengan melampirkan syarat : a) Slip Pembayaran Wisuda. b) Surat Bebas Perpustakaan Pusat. c) Surat Bebas Fakultas. c. Memenuhi persyaratan lainnya yang telah ditentukan oleh Universitas / Fakultas"
      ]
    },
    {
      "tag":"definisi_proposal_TA",
      "patterns":["Apa pengertian dari proposal Tugas Akhir?","Apa yang dimaksud dengan proposal TA?","Definisi dari proposal TA?","Apa yang dimaksud dengan proposal Tugas Akhir?","Apa itu proposal TA?","Jelaskan apa yang dimaksud dari proposal Tugas Akhir?","Proposal Tugas Akhir itu apa?","Apa esensi dari proposal Tugas Akhir?","Bagaimana konsep proposal TA diartikan?","Apa rinciannya dari proposal TA?","Bagaimana proposal Tugas Akhir didefinisikan?","Apa pokok pembahasan dalam proposal TA?","Jelaskan makna yang terkandung dalam proposal Tugas Akhir.","Apa gambaran umum tentang proposal TA?","Bagaimana proposal Tugas Akhir dapat dijelaskan?","Apa tujuan utama dari proposal TA?","Jelaskan pengertian dari proposal Tugas Akhir.","Apa arti dari istilah proposal Tugas Akhir?","Bagaimana proposal TA dijabarkan?","Apa yang diartikan dengan proposal Tugas Akhir?","Apa esensial dari konsep proposal TA?","Apa yang dapat diartikan dari proposal Tugas Akhir?","Apa esensi utama yang terkandung dalam proposal Tugas Akhir?","Bagaimana proposal TA bisa diuraikan?","Apa inti dari definisi proposal Tugas Akhir?","Bagaimana konsep proposal TA dapat dijelaskan?","Apa yang dimaksud dengan proposal Tugas Akhir secara umum?","Apa yang menjadi ciri khas dalam proposal TA?","Apa yang bisa diinterpretasikan dari proposal Tugas Akhir?","Bagaimana proposal TA dapat diartikan dengan lebih detail?","Apa tujuan pokok dari pembuatan proposal TA?","Bagaimana gambaran umum mengenai esensi proposal Tugas Akhir?","Apa makna sebenarnya dari proposal TA?","Apa pesan yang ingin disampaikan melalui proposal Tugas Akhir?","Bagaimana proposal Tugas Akhir bisa dijelaskan secara komprehensif?","Apa yang terkandung dalam istilah 'proposal Tugas Akhir'?","Bagaimana pengertian proposal TA dapat diuraikan dengan jelas?","Apa pengertian sebenarnya dari proposal Tugas Akhir?","Apa yang sebenarnya dimaksud dengan proposal TA?","Bagaimana definisi sebenarnya dari proposal TA?","Apa yang sebenarnya dimaksudkan dengan proposal Tugas Akhir?","Apa yang sebenarnya menjadi makna dari istilah proposal TA?","Jelaskan arti sebenarnya dari proposal Tugas Akhir.","Proposal Tugas Akhir sebenarnya itu apa?","Apa esensi yang sebenarnya terkandung dalam proposal Tugas Akhir?","Bagaimana konsep sebenarnya dari proposal TA bisa diartikan?","Apa rincian sebenarnya dari proposal TA?","Bagaimana sebenarnya proposal Tugas Akhir didefinisikan?","Apa yang sebenarnya menjadi fokus utama dalam proposal TA?","Jelaskan makna yang sesungguhnya terkandung dalam proposal Tugas Akhir.","Apa gambaran keseluruhan yang sebenarnya tentang proposal TA?","Bagaimana proposal Tugas Akhir sebenarnya dapat dijelaskan?","Apa tujuan utama yang sebenarnya dari proposal TA?","Jelaskan pengertian yang sebenarnya dari proposal Tugas Akhir.","Apa sebenarnya arti dari istilah 'proposal Tugas Akhir'?","Bagaimana sebenarnya proposal TA dijabarkan?","Apa yang sebenarnya diartikan dengan proposal Tugas Akhir secara umum?"],
      "responses":[
          "Proposal TA adalah suatu bentuk rancangan, desain penelitian atau usulan penelitian yang akan dilakukan dan disusun oleh seorang mahasiswa tentang suatu bahan penelitian untuk pembuatan TA."
      ]
    },
    {
      "tag":"penulisan_proposal_TA",
      "patterns":["Bagaimana cara menyusun proposal TA?","Metodologi penulisan proposal Tugas Akhir?","Apa langkah-langkah pembuatan proposal TA?","Teknik penulisan proposal Tugas Akhir?","Bagaimana strategi merancang proposal TA?","Proses penyusunan proposal TA?","Apa yang termasuk dalam isi proposal TA?","Tata cara mengembangkan proposal Tugas Akhir?","Apa saja isi dalam proposal Tugas Akhir atau TA?","Apa yang menjadi bagian dari isi proposal Tugas Akhir atau TA?","Bagaian-bagian dalam penulisan proposal TA atau Tugas Akhir?","Cara penulisan proposal tugas Akhir atau TA?","Bagaimana langkah-langkah dalam penyusunan proposal TA?","Metode penulisan yang digunakan dalam merangkai proposal Tugas Akhir?","Apa prosedur pembuatan proposal TA?","Bagaimana teknik penulisan yang digunakan dalam menyusun proposal Tugas Akhir?","Bagaimana strategi yang diterapkan dalam merancang proposal TA?","Tahapan proses penyusunan proposal TA?","Apa yang termasuk dalam konten atau isi proposal TA?","Tata cara efektif dalam mengembangkan proposal Tugas Akhir?","Apa komponen-komponen yang ada dalam proposal Tugas Akhir atau TA?","Bagian-bagian utama dalam penulisan proposal TA atau Tugas Akhir?","Cara terbaik dalam menulis proposal Tugas Akhir atau TA?","Bagaimana langkah-langkah dalam merancang proposal TA?","Apa proses yang harus ditempuh dalam penyusunan proposal Tugas Akhir?","Metodologi penulisan apa yang digunakan dalam menyusun proposal Tugas Akhir?","Apa strategi yang bisa diterapkan dalam merancang proposal TA?","Tata cara mengembangkan isi proposal Tugas Akhir bagaimana?","Apa yang termasuk dalam konten atau isi proposal Tugas Akhir?","Apa saja tahapan yang perlu dilewati dalam pembuatan proposal TA?","Apa teknik penulisan yang efektif dalam menyusun proposal Tugas Akhir?","Bagaimana komponen-komponen dalam proposal Tugas Akhir atau TA disusun?","Apa yang menjadi bagian utama dalam penulisan proposal Tugas Akhir?","Bagaimana cara yang tepat dalam menulis proposal Tugas Akhir atau TA?","Apa langkah-langkah yang harus diikuti dalam merancang proposal Tugas Akhir?","Apa yang termasuk dalam isi atau konten proposal Tugas Akhir?","Bagaimana cara terbaik dalam merancang isi proposal TA?","Proses seperti apa dalam penyusunan proposal Tugas Akhir?","Metode apa yang digunakan dalam penulisan proposal Tugas Akhir?","Apa yang perlu diperhatikan dalam mengembangkan proposal Tugas Akhir?","Apa bagian-bagian yang ada dalam proposal Tugas Akhir atau TA?","Tata cara yang optimal dalam mengembangkan proposal Tugas Akhir?","Bagaimana langkah-langkah dalam menyusun proposal Tugas Akhir dengan baik?"],
      "responses":[
          "Proposal TA memiliki beberapa bagian, antara lain bagian awal, bagian utama, dan bagian akhir.Bagian awal dalam proposal terdiri atas halaman sampul, halaman pengesahan, daftar isi; sedangkan pada bagian utama berisikan latar belakang permasalahan, perumusan masalah, tujuan dan manfaat penelitian, kerangka teori atau tinjauan pustaka dan metode penelitian; untuk bagian akhir terdapat daftar pustaka dan lampiran."
      ]
    },
    {
      "tag":"sebelum_pengajuan",
      "patterns":["Apa langkah yang harus dijalankan setelah menyelesaikan penulisan proposal TA atau Tugas Akhir?","Bagaimana langkah berikutnya setelah menyelesaikan penyusunan proposal TA atau Tugas Akhir?","Apa yang harus dilaksanakan setelah menyiapkan proposal TA atau Tugas Akhir?","Apa yang harus dilakukan setelah membuat proposal TA atau Tugas Akhir?","Setelah menulis proposal apa yang harus dilakukan?","Sebelum mengajukan proposal TA atau Tugas Akhir apa yang harus dilakukan?","Apa yang harus dilakukan sebelum mengajukan proposal TA?","Setelah menyelesaikan penulisan proposal TA atau Tugas Akhir, langkah apa yang sebaiknya diambil?","Bagaimana tindakan selanjutnya setelah menyelesaikan penyusunan proposal TA atau Tugas Akhir?","Apa langkah berikutnya yang perlu dilakukan setelah menyiapkan proposal TA atau Tugas Akhir?","Setelah menyelesaikan penulisan proposal TA atau Tugas Akhir, apa tindakan yang harus dilaksanakan?","Usai menulis proposal, langkah apa yang harus dijalankan?","Sebelum mengajukan proposal TA atau Tugas Akhir, hal apa yang perlu dilakukan?","Apa persiapan yang harus dilakukan sebelum mengajukan proposal TA?","Setelah menyelesaikan penulisan proposal, apa langkah yang perlu dipersiapkan?","Apa yang harus dilakukan setelah menyelesaikan penulisan proposal sebelum diajukan?","Setelah menyelesaikan penyusunan proposal, apa langkah yang perlu dipertimbangkan?","Apa langkah yang perlu diambil setelah menyelesaikan penulisan proposal TA atau Tugas Akhir?","Bagaimana langkah berikutnya usai menyelesaikan penyusunan proposal TA atau Tugas Akhir?","Apa tindakan yang harus dilaksanakan setelah menyiapkan proposal TA atau Tugas Akhir?","Apa yang harus dilakukan setelah berhasil membuat proposal TA atau Tugas Akhir?","Setelah menulis proposal, langkah apa yang sebaiknya diambil selanjutnya?","Sebelum mengajukan proposal TA atau Tugas Akhir, apa persiapan yang perlu dilakukan?","Apa yang harus dikerjakan sebelum mengajukan proposal TA?","Setelah menyelesaikan penulisan proposal TA atau Tugas Akhir, langkah apa yang sebaiknya dilakukan?","Bagaimana tindakan selanjutnya setelah menyelesaikan penyusunan proposal TA atau Tugas Akhir?","Apa langkah berikutnya yang perlu dilakukan setelah menyiapkan proposal TA atau Tugas Akhir?","Setelah menyelesaikan penulisan proposal TA atau Tugas Akhir, apa tindakan yang harus dilaksanakan?","Usai menulis proposal, langkah apa yang harus dijalankan selanjutnya?","Sebelum mengajukan proposal TA atau Tugas Akhir, apa yang sebaiknya dipersiapkan?","Apa persiapan yang harus dilakukan setelah menyelesaikan penulisan proposal sebelum diajukan?","Setelah menyelesaikan penyusunan proposal, apa langkah yang perlu dipertimbangkan?","Apa langkah selanjutnya setelah menyelesaikan proses penulisan proposal TA atau Tugas Akhir?","Bagaimana cara melanjutkan setelah menyelesaikan penyusunan proposal TA atau Tugas Akhir?","Apa tindakan yang sebaiknya diambil setelah menyiapkan proposal TA atau Tugas Akhir?","Apa yang perlu dikerjakan setelah menyelesaikan pembuatan proposal TA atau Tugas Akhir?","Setelah menyelesaikan penulisan proposal, langkah apa yang seharusnya diambil berikutnya?"],
      "responses":[
          "Konsep proposal dapat diajukan atau didiskusikan terlebih dahulu ke dosen wali maupun calon dosen pembimbing sesuai bidang keahlian pada saat Pra-Proposal sebelum diajukan ke koodinator TA, dalam tahap Pra-Proposal dosen akan memberikan catatan, masukan, koreksi yang harus diperhatikan dan diperbaiki."
      ]
    }
  ]
}
